Hello!
I am going to close this issue since most of the involved code paths have been re-written for terraform 0.12. 
I was able to confirm that the example code here evaluates correctly in terraform 0.12:

```
  # aws_instance.ec2_instance_bad[0] will be created
  + resource "aws_instance" "ec2_instance_bad" {
      + ami                          = "ami-1233454565432"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + disable_api_termination      = true
       ... etc
```

If you see any further problems, please open a new issue. Thanks!